emacs/.emacs.d/config.org
*** General settings

#+begin_src emacs-lisp :tangle "modules/slp-org.el" :mkdirp yes
  ;;; General org settings
  (use-package org
    :ensure nil ; org is built-in
    :bind (("C-c c" . org-capture)
           ("C-c a" . org-agenda)
           ("C-c l" . org-store-link))
    :custom
    (org-directory (expand-file-name "~/Documents/org/"))
    (org-imenu-depth 7)
    (org-ellipsis " â–¼")
    (org-special-ctrl-a/e nil)
    (org-special-ctrl-k nil)
    (org-M-RET-may-split-line '((default . nil)))
    (org-hide-emphasis-markers nil)
    (org-hide-macro-markers nil)
    (org-hide-leading-stars nil)
    (org-cycle-separator-lines 0)
    (org-fold-catch-invisible-edits 'show)
    (org-return-follows-link nil)
    (org-loop-over-headlines-in-active-region 'start-level)
    (org-insert-heading-respect-content t)
    (org-read-date-prefer-future 'time)
    (org-highlight-latex-and-related nil) ; other options affect elisp regexp in src blocks
    (org-fontify-quote-and-verse-blocks t)
    (org-fontify-whole-block-delimiter-line t)
    (org-track-ordered-property-with-tag t)
    (org-structure-template-alist
     '(("s" . "src")
  	 ("e" . "src emacs-lisp")
  	 ("E" . "src emacs-lisp :results value code :lexical t")
  	 ("t" . "src emacs-lisp :tangle FILENAME")
  	 ("T" . "src emacs-lisp :tangle FILENAME :mkdirp yes")
  	 ("x" . "example")
  	 ("X" . "export")
  	 ("q" . "quote")))

    :config
    (defvar slp/deep-work-file
      (expand-file-name "deep-work.org" org-directory)
      "Path to deep work org file.")

    (defvar slp/journal-file
      (expand-file-name "journal.org" org-directory)
      "Path to journal org file.")

    (setq org-agenda-files (list slp/deep-work-file))

    (setq org-capture-templates
      `(("w" "Work Task"
         entry
         (file+headline ,slp/deep-work-file "Tasks")
         "* TODO %^{Task description}\nSCHEDULED: %^t\n:PROPERTIES:\n:WORK_TYPE: %^{Work type|deep|shallow}\n:EFFORT: %^{Effort|2:00|1:30|0:30|0:15}\n:BEST_TIME: %^{Best time|morning|afternoon|evening|anytime}\n:END:\n%U\n"
         :empty-lines 1)
        
        ;; Keep specialized ones if you want quick access to common patterns
        ("d" "Deep Work (quick)" 
         entry
         (file+headline ,slp/deep-work-file "Tasks")
         "* TODO %^{Task description}\nSCHEDULED: %^t\n:PROPERTIES:\n:WORK_TYPE: deep\n:EFFORT: 2:00\n:BEST_TIME: morning\n:END:\n%U\n"
         :empty-lines 1)
        
        ("q" "Quick Shallow (quick)"
         entry
         (file+headline ,slp/deep-work-file "Tasks")
         "* TODO %^{Task description}\n:PROPERTIES:\n:WORK_TYPE: shallow\n:EFFORT: 0:15\n:BEST_TIME: anytime\n:END:\n"
         :empty-lines 1)

        ("j" "Journal Entry"
         entry
         (file+datetree ,slp/journal-file)
         "* %<%H:%M> %^{Title}\n%?\n"
         :empty-lines 1)))

    ;; Custom agenda commands
    (setq org-agenda-custom-commands
      '(("d" "Deep Work Queue"
         tags-todo "WORK_TYPE=\"deep\""
         ((org-agenda-overriding-header "ðŸ§  Deep Work Sessions Available")
          (org-agenda-prefix-format " %i %-12:c [%e] ")
          (org-agenda-sorting-strategy '(priority-down effort-down))))
        
        ("s" "Shallow Work Queue"
         tags-todo "WORK_TYPE=\"shallow\""
         ((org-agenda-overriding-header "ðŸ“‹ Shallow Work Tasks")
          (org-agenda-prefix-format " %i %-12:c [%e] ")
          (org-agenda-sorting-strategy '(priority-down effort-up))))
        
        ("w" "Work Type Overview"
         ((tags-todo "WORK_TYPE=\"deep\""
                     ((org-agenda-overriding-header "ðŸ§  Deep Work (Uninterrupted Focus)")
                      (org-agenda-prefix-format " %i %-12:c [%e] ")))
          (tags-todo "WORK_TYPE=\"shallow\""
                     ((org-agenda-overriding-header "ðŸ“‹ Shallow Work (Administrative)")
                      (org-agenda-prefix-format " %i %-12:c [%e] "))))
         ((org-agenda-sorting-strategy '(priority-down effort-down))))
        
        ;; Additional useful views
        ("t" "Today's Schedule"
         agenda ""
         ((org-agenda-span 'day)
          (org-agenda-overriding-header "ðŸ“… Today's Schedule")))
        
        ("n" "Next 7 Days"
         agenda ""
         ((org-agenda-span 7)
          (org-agenda-overriding-header "ðŸ“† Week Ahead"))))))
#+end_src


*** Provide Org

#+begin_src emacs-lisp :tangle "modules/slp-org.el"
  (provide 'slp-org)
#+end_src


** Calendar

I use [[https://github.com/kiwanami/emacs-calfw][Calfw]] to manage my calendar in Emacs.



** Dired

Emacs comes with =Dired=, a built-in file manager.
The following settings define some basic refinements to the behavior of common operations for copying, renaming and deleting files.

=Dired= displays extensive details by default, which are hidden here using ~hide-hide-details-mode~ for a cleaner view.

#+begin_src emacs-lisp :tangle "modules/slp-dired.el"
  (use-package dired
    :ensure nil
    :commands (dired)
    :hook
    ((dired-mode . dired-hide-details-mode)
     (dired-mode . hl-line-mode))
    :config
    (setq dired-recursive-copies 'always)
    (setq dired-recursive-deletes 'always)
    (setq dired-dwim-target t))
#+end_src

The =dired-subtree= package allows expanding and collapsing directory subtrees directly in the Dired buffer using =TAB= or =SHIFT-TAB=.

#+begin_src emacs-lisp :tangle "modules/slp-dired.el"
  (use-package dired-subtree
    :ensure t
    :after dired
    :bind
    ( :map dired-mode-map
      ("<tab>" . dired-subtree-toggle)
      ("TAB" . dired-subtree-toggle)
      ("<backtab>" . dired-subtree-remove)
      ("S-TAB" . dired-subtree-remove))
    :config
    (setq dired-subtree-use-backgrounds nil))
#+end_src

*** Provide Dired

#+begin_src emacs-lisp :tangle "modules/slp-dired.el"
  (provide 'slp-dired)
#+end_src

** Spellchecking and grammar checking

I write a lot of prose in Emacs (as evident from the fact I write prose to configure Emacs itself), and thus spellchecking and grammatical checking is nice features to have.

*** Spellchecking

A general-purpose spellchecker complements =Cape=, highlighting misspelled words in the visible portion of buffers, particularly useful when editing prose or collaborative documents.

Using many of his other packages for their excellent and well-documented features, Daniel Mendler's [[https://github.com/minad/jinx][jinx]] package stood out to me.

On Arch Linux, it requires the packages ~enchant~ and ~pkgconf~ to be installed already.

#+begin_src emacs-lisp :tangle "modules/slp-spellcheck.el"
  (use-package jinx
    :ensure t
    :hook (emacs-startup . global-jinx-mode)
    :bind (("M-$" . jinx-correct)
           ("C-M-$" . jing-languages)))
#+end_src

*** Grammar checking

#+begin_src emacs-lisp :tangle "modules/slp-spellcheck.el"
  (use-package flycheck
    :ensure t
    :hook ((text-mode org-mode markdown-mode) . flycheck-mode))

  ;; Custom Vale checker instead of flycheck-vale package
  (flycheck-define-checker vale
    "A checker for prose using Vale"
    :command ("vale" "--output" "line" source)
    :standard-input nil
    :error-patterns
    ((error line-start (file-name) ":" line ":" column ":" (id (one-or-more (not (any ":")))) ":" (message) line-end))
    :modes (markdown-mode org-mode text-mode))

  (add-to-list 'flycheck-checkers 'vale 'append)


#+end_src

*** Provide Spellchecking and grammar checking

#+begin_src emacs-lisp :tangle "modules/slp-spellcheck.el"
  (provide 'slp-spellcheck)
#+end_src

** Version Control

Version control tracks changes to files over time. I use it extensively, both for code and prose, often publishing work on platforms like GitHub.

Emacs has many great packages to make version control easier and useful for most workflows, and mine heavily revolves around [[https://magit.vc/][Magit]] by Jonas Bernoulli.

*** Highlight differences between upstream and local

[[https://github.com/dgutov/diff-hl][diff-hl]] is a package which highlights uncommitted changes on the side of the window, and allows one to jump between and revert them selectively.
It also works for =Dired=.

It works on "hunks", which is another word for current local versions against a version-controlled upstream.

Since I want to really utilize the packages I install and enable more, I have decided to list =diff-hl='s commands in an effort to remember these exist, as well as how to invoke them.

| Provided commands             | Keybinding | Explanation                                                                                                                                                       |
|-------------------------------+------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| ~diff-hl-diff-goto-hunk~      | ~C-x v =~  | Shows a side-by-side diff of the current "hunk" and the last committed version.                                                                                   |
| ~diff-hl-revert-hunk~         | ~C-x v n~  | Reverts the current hunk to its last committed state.                                                                                                             |
| ~diff-hl-previous-hunk~       | ~C-x v [~  | Moves the cursor to the previous hunk in the buffer.                                                                                                              |
| ~diff-hl-next-hunk~           | ~C-x v ]~  | Moves the cursor to the next hunk in the buffer.                                                                                                                  |
| ~diff-hl-show-hunk~           | ~C-x v *~  | Shows a popup of the hunk at point, usually in a temporary window or overlay.                                                                                     |
| ~diff-hl-stage-current-hunk~  | ~C-x v S~  | Stages the current hunk for commit.                                                                                                                               |
| ~diff-hl-set-reference-rev~   |            | Sets a reference revision for comparison. Normally, diff-hl compares against HEAD. With this command, one can set a specific commit or branch to compary against. |
| ~diff-hl-reset-reference-rev~ |            | Resets the reference revision back to the default.                                                                                                                |
| ~diff-hl-unstage-file~        |            | Unstages all changes in the current file.                                                                                                                         |

I enable it globally, as more than just my code is version-controlled, and thus it is useful in almost any buffer I open.
Hooks are added to integrate =diff-hl= with =Magit= for automatic updates.

#+begin_src emacs-lisp :tangle "modules/slp-vc.el"
  (use-package diff-hl
    :after magit
    :ensure t
    :hook ((magit-pre-refresh . diff-hl-magit-pre-refresh)
           (magit-post-refresh . diff-hl-magit-post-refresh))
    :config
    (global-diff-hl-mode))
#+end_src

*** Magit

[[https://magit.vc/][Magit]] is a complete text-based user interface to =Git= (a so-called "Git Porcelain").

Details TBD.

#+begin_src emacs-lisp :tangle "modules/slp-vc.el"
  (use-package magit
    :ensure-system-package git
    :ensure t
    :bind (("M-g b" . magit-blame-addition)
           :map magit-mode-map
           ("C-M-f" . magit-section-forward)
           ("C-M-b" . magit-section-backward))
    :config
    (setq magit-mode-quit-window 'magit-restore-window-configuration
          magit-auto-revert-mode t))
#+end_src

*** Forge

Forge adds GitHub/GitLab integration, configured here (details TBD).

#+begin_src emacs-lisp :tangle "modules/slp-vc.el"
  (use-package forge
    :ensure t
    :after magit)
#+end_src

*** Blamer

Blamer adds a blame plugin inspired by VS Code's GitLens, which shows details for the currently selected line(s) regarding what commit the line is from, and who wrote it.

#+begin_src emacs-lisp :tangle "modules/slp-vc.el"
  (use-package blamer
    :ensure t
    :after magit
    :bind (("C-c g i" . blamer-show-commit-info)
           ("C-c g b" . blamer-show-posframe-commit-info))
    :custom
    (blamer-idle-time 0.3)
    (blamer-min-offset 4)
    (blamer-max-commit-message-length 100)
    (blamer-datetime-formatter "[%s]")
    (blamer-commit-formatter " â— %s")
    :custom-face
    (blamer-face ((t :foreground "#7aa2cf"
                     :background nil
                     :height 1
                     :italic nil))))
#+end_src

*** Git link

Provides URLs to GitHub/GitLab commits, PRs, etc. Details TBD

#+begin_src emacs-lisp :tangle "modules/slp-vc.el"
  (use-package git-link
    :ensure t
    :custom
    (git-link-use-commit t)
    (git-link-open-in-browser t))
#+end_src

*** Git timemachine

Lets me browse a file's previous revisions, and therefore complements =diff-hl=, =Magit= and =Blamer=.

#+begin_src emacs-lisp :tangle "modules/slp-vc.el"
  (use-package git-timemachine
    :ensure t)
#+end_src

*** Provide Version Control

#+begin_src emacs-lisp :tangle "modules/slp-vc.el"
  (provide 'slp-vc)
#+end_src


** Chatting

*** ERC

[[https://www.gnu.org/software/emacs/erc.html][ERC]] is a built-in Emacs package which allows us to connect and communicate via the Internet Relay Chat (IRC) Protocol.
It is widely used in free software and open source development spaces, and so I configure Emacs to be able to connect and be used for it.

#+begin_src emacs-lisp :tangle "modules/slp-chatting.el"
  (use-package erc
    :config
    (setopt erc-modules
            (seq-union '(nicks bufbar nickbar scrolltobottom)
                        erc-modules))

    :custom
    ;; Avoid sending excess lines
    (erc-inhibit-multiline-input t)
    (erc-send-whitespace-lines t)
    (erc-ask-about-multiline-input t)
    ;; Scroll all windows to prompt when submitting input.
    (erc-scrolltobottom-all t)
    ;;  Reconnect automatically
    (erc-server-reconnect-function #'erc-server-delayed-check-reconnect)
    (erc-server-reconnect-timeout 30)

    (erc-nick "seblp")
    (erc-user-full-name "Sebastian Larsen Prehn")
    ;; Show new buffers in the current window instead of a split.
    (erc-interactive-display 'buffer)

    (erc-hide-list '("JOIN" "PART" "QUIT"))
    (erc-lurker-hide-list '("JOIN" "PART" "QUIT"))
    ;; Emphasize buttonized text in notices.
    :custom-face (erc-notice-face ((t (:slant italic :weight unspecified)))))

  (use-package erc-join
  :custom 
  (erc-autojoin-channels-alist 
   '((Libera.Chat "#emacs" "#diku" "#erc" "#archlinux" 
                  "#archlinux-offtopic" "#archlinux-aur" "#archlinux-security"))))

  (use-package erc-fill
    :custom
    ;; Prefer one message per line without continuation indicators.
    (erc-fill-function #'erc-fill-wrap)
    (erc-fill-static-center 18))
#+end_src

#+begin_src emacs-lisp :tangle "modules/slp-chatting.el"
(defun slp/connect-libera ()
     (interactive)
     (erc-tls :server "irc.libera.chat" :port 6697
              :client-certificate t))
#+end_src

